# Ответ на вопрос о возможности проверки сразу нескольких значений продолжительности: считаю, что список и правда мог бы облегчить задачу. Соответственно, я бы задал его следующим образом:
# duration = [3700, 86400, ... ], затем условие проверки бы задал индекс для каждого элемента idx = 0 и через enumerate в списке for duration_number in duration
# оставил бы текущий вариант проверки с добавлением условия в каждом условном блоке idx += 1. Но у меня так не получилось сделать на практике.
# Возможный вариант проверки нескольких условий - создание функции с условием, что выполнение программы остановится после ввода "quit" в переменную duration

# Первый вариант решения был с переменными, второй просто с print одной строкой
duration = int(input('Введите продолжительность временного отрезка в секундах для проверки: '))

if duration < 0:
    print('Тут вам не Интерстеллар')
elif 0 <= duration < 60:
    print(duration % 60, 'сек')
elif 60 <= duration < 3600:
    print(duration // 60, 'мин', duration % 60, 'сек')
elif 3600 <= duration < 86400:
    print(duration // 3600, 'час', duration % 3600 // 60, 'мин', duration % 60, 'сек')
else:
    print(duration // 86400, 'дн', duration % 86400 // 3600, 'час', duration % 86400 % 3600 // 60, 'мин', duration % 60, 'сек')


